app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    if params[:author_id]
      # establish existence of author_id
      author = Author.find_by(id: params[:author_id])
        # if it's there, find valid author
      if author.nil?
        redirect_to authors_path, alert: "Author not found."
      else
        # if an author is found, find posts using id
        @post = author.posts.find_by(id: params[:id])